<?php

//設定ファイルを追加・変更したら以下のコマンドで設定キャッシュを再生成
//php artisan config:cache

return [

    'admin_memo_path' => storage_path('app/admin_memo'), // 管理者メモの保存ディレクトリ

    //=====================================================
    //フレンドリスト
    //=====================================================
    'friend_status' => [
        'pending'  => 0, // 未承認
        'accepted' => 1, // 承認済み
        'declined' => 2, // 拒否済み
    ],

    //=====================================================
    // ユーザーリクエスト
    //=====================================================
    'request_type' => [
        'request'  => 0, // 要望
        'inquiry' => 1, // 問い合わせ
    ],
    
    'request_status' => [
        'unresolved' => 0, // 未対応
        'resolved'   => 1, // 対応済
    ],

    //=====================================================
    // IoTデバイス
    //=====================================================
    'device_type' => [
        'IRRemote'  => 0, // 赤外線リモコン
        'SmartLock' => 1, // スマートロック
    ],
    
    'request_status' => [
        'unresolved' => 0, // 未対応
        'resolved'   => 1, // 対応済
    ],

    //=====================================================
    // 仮想リモコン
    //=====================================================
    'remote_kind' => [
        'テレビ'       => 0,
        '照明'       => 1,
        'エアコン'     => 2,
        'ロボット掃除機' => 3,
        'オーディオ'   => 4,
        'プロジェクター' => 5,
        '扇風機'     => 6,
        'ブルーレイ・DVD' => 7,
        'その他' => 99,
    ],
];