<?php

//設定ファイルを追加・変更したら以下のコマンドで設定キャッシュを再生成
//php artisan config:cache

return [

    'admin_memo_path' => storage_path('app/admin_memo'), // 管理者メモの保存ディレクトリ
    'smart_remote_blade_paht' => 'smart_remote', // スマートリモコンデザインの保存ディレクトリ

    //=========================================================================
    //フレンドリスト
    //=========================================================================
    'friend_status' => [
        'pending'  => 0, // 未承認
        'accepted' => 1, // 承認済み
        'declined' => 2, // 拒否済み
    ],

    //=========================================================================
    // ユーザーリクエスト
    //=========================================================================
    'request_type' => [
        'request'  => 0, // 要望
        'inquiry' => 1, // 問い合わせ
    ],
    
    'request_status' => [
        'unresolved' => 0, // 未対応
        'resolved'   => 1, // 対応済
    ],

    //=============================================================================================
    // IoTデバイス管理（ID範囲に基づく）
    // 表示用アイコン (アイコン情報：https://fontawesome.com/)
    //=============================================================================================
    // カテゴリーのID範囲定義（ロジック用）
    'device_range' => [
        'HUB'      => [1, 99],      // 1-99: 制御デバイス (HUB)             全体を制御するハブデバイス 常時MQTT接続。
        'ACTUATOR' => [100, 299],   // 100-299: 動作デバイス (ACTUATOR)     ハブからの信号で動作するデバイス
        'TRIGGER'  => [300, 499],   // 300-499: トリガーデバイス (TRIGGER)  ハブへ通知して制御を促すデバイス
    ],
    'device_info' => [
        // 1-99
        1   => ['type_name' => 'ｽﾏｰﾄﾎｰﾑ',           'icon_class' => 'fa-tower-broadcast',         'description' => 'スマートデバイス全体の司令塔',],
        // 100-299
        101 => ['type_name' => 'ｽﾏｰﾄﾛｯｸ',           'icon_class' => 'fa-lock',                     'description' => '自宅等の施錠・解錠',],
        102 => ['type_name' => 'ｽﾏｰﾄﾌﾞﾗｲﾝﾄﾞ',         'icon_class' => 'fa-scroll',                   'description' => '昇降・開閉',],
        // 300-499
        301 => ['type_name' => '認証ﾘｰﾀﾞｰ',          'icon_class' => 'fa-address-card',             'description' => 'ICカードやスマホによる解錠トリガー',],
        302 => ['type_name' => '人感ｾﾝｻｰ',          'icon_class' => 'fa-person-walking',           'description' => '人の動きを検知して通知',],
    ],

    //=========================================================================
    // 仮想リモコン
    //=========================================================================
    'remote_kind' => [
        'テレビ'       => 0,
        '照明'       => 1,
        'エアコン'     => 2,
        'ロボット掃除機' => 3,
        'オーディオ'   => 4,
        'プロジェクター' => 5,
        '扇風機'     => 6,
        'ブルーレイ・DVD' => 7,
        'その他' => 99,
    ],

    // 値は、config('common.remote_kind') の値（0, 1, 2...）と一致させる
    //アイコン情報：https://fontawesome.com/
    'remote_kind_icons' => [
        0 => 'fa-tv',
        1 => 'fa-lightbulb', 
        2 => 'fa-wind',
        3 => 'fa-robot',
        4 => 'fa-volume-high',
        5 => 'fa-video',
        6 => 'fa-fan',
        7 => 'fa-compact-disc',
        99 => 'fa-question',
    ],
];